src/test/resources/smartwool/payment-2.json

[
   {
      "id":"TEST2",
      "merchant_id":"JAZ12K8TQGWNG",
      "creator_id":"JAZ12K8TQGWNG",
      "created_at":"2017-08-09T19:08:58Z",
      "device":{
         "id":"DEVICE_INSTALLATION_ID:3E91B4BB-D811-409B-96B4-586AE0A1C001",
         "name":"Jordan"
      },
      "payment_url":"https://squareup.com/dashboard/sales/transactions/JNLTK9LN1OF0utQjGqYJQ8keV",
      "receipt_url":"https://squareup.com/receipt/preview/tgeNzLmYedOTIWaKLRuvoxMF",
      "inclusive_tax_money":{
         "amount":0,
         "currency_code":"USD"
      },
      "additive_tax_money":{
         "amount":0,
         "currency_code":"USD"
      },
      "tax_money":{
         "amount":0,
         "currency_code":"USD"
      },
      "tip_money":{
         "amount":0,
         "currency_code":"USD"
      },
      "discount_money":{
         "amount":0,
         "currency_code":"USD"
      },
      "total_collected_money":{
         "amount":100,
         "currency_code":"USD"
      },
      "processing_fee_money":{
         "amount":-3,
         "currency_code":"USD"
      },
      "net_total_money":{
         "amount":97,
         "currency_code":"USD"
      },
      "refunded_money":{
         "amount":-100,
         "currency_code":"USD"
      },
      "swedish_rounding_money":{
         "amount":0,
         "currency_code":"USD"
      },
      "gross_sales_money":{
         "amount":100,
         "currency_code":"USD"
      },
      "net_sales_money":{
         "amount":100,
         "currency_code":"USD"
      },
      "inclusive_tax":[

      ],
      "additive_tax":[

      ],
      "tender":[
         {
            "type":"CREDIT_CARD",
            "name":"Credit Card",
            "id":"tgeNzLmYedOTIWaKLRuvoxMF",
            "total_money":{
               "amount":100,
               "currency_code":"USD"
            },
            "card_brand":"MASTER_CARD",
            "pan_suffix":"5100",
            "entry_method":"SWIPED",
            "refunded_money":{
               "amount":-100,
               "currency_code":"USD"
            },
            "receipt_url":"https://squareup.com/receipt/preview/tgeNzLmYedOTIWaKLRuvoxMF"
         }
      ],
      "refunds":[
         {
            "type":"FULL",
            "created_at":"2017-08-09T19:10:50Z",
            "processed_at":"2017-08-09T19:28:26Z",
            "reason":"Canceled Order",
            "refunded_money":{
               "amount":-100,
               "currency_code":"USD"
            },
            "payment_id":"tgeNzLmYedOTIWaKLRuvoxMF",
            "merchant_id":"JAZ12K8TQGWNG",
            "refunded_processing_fee_money":{
               "amount":3,
               "currency_code":"USD"
            },
            "refunded_additive_tax_money":{
               "amount":0,
               "currency_code":"USD"
            },
            "refunded_inclusive_tax_money":{
               "amount":0,
               "currency_code":"USD"
            },
            "refunded_tip_money":{
               "amount":0,
               "currency_code":"USD"
            },
            "refunded_discount_money":{
               "amount":0,
               "currency_code":"USD"
            }
         }
      ],
      "itemizations":[
         {
            "name":"Custom Amount",
            "quantity":"1.00000000",
            "item_detail":{
               "category_name":"",
               "sku":""
            },
            "itemization_type":"CUSTOM_AMOUNT",
            "total_money":{
               "amount":100,
               "currency_code":"USD"
            },
            "single_quantity_money":{
               "amount":100,
               "currency_code":"USD"
            },
            "gross_sales_money":{
               "amount":100,
               "currency_code":"USD"
            },
            "discount_money":{
               "amount":0,
               "currency_code":"USD"
            },
            "net_sales_money":{
               "amount":100,
               "currency_code":"USD"
            },
            "taxes":[

            ],
            "discounts":[

            ],
            "modifiers":[

            ]
         }
      ]
   }
]
