src/test/resources/smartwool/refund-1.json

[
    {
        "type": "FULL",
        "created_at": "2017-07-31T21:15:53Z",
        "processed_at": "2017-07-31T21:23:43Z",
        "reason": "Reason",
        "refunded_money": {
            "currency_code": "USD",
            "amount": -102
        },
        "payment_id": "fVxn47clNDHizQLAan65WyMF",
        "merchant_id": "JAZ12K8TQGWNG"
    }
]
