src/test/resources/smartwool/refund-2.json

[
    {
        "type": "FULL",
        "created_at": "2017-07-31T21:26:37Z",
        "processed_at": "2017-07-31T21:38:45Z",
        "reason": "Returned goods",
        "refunded_money": {
            "currency_code": "USD",
            "amount": -204
        },
        "payment_id": "mjjFBQzdviJeUAFethzbsxMF",
        "merchant_id": "JAZ12K8TQGWNG"
    }
]
